{"pages":[{"title":"404","text":"","path":"404/index.html","date":"04-24","excerpt":""},{"title":"search","text":"","path":"search/index.html","date":"04-24","excerpt":""}],"posts":[{"title":"阅读","text":"怎么阅读 [TOC] 怎么阅读 早晨阅读 阅读前运动 阅读动机指定奖励 预期与移开尽可能多的障碍,确保早晨起来时一起都可以直接进行不会分心 公开记录每天的进度 如何更聪明的学习 让学习时间分成一部分一部分的组块,因为注意力集中的时间平均为25分钟到30分钟 创造一个专注学习的空间,理由所身处的环境很大程度上决定着我们行为,更容易投入 学习积极性,在学习之前先问自己,我要学习的是什么,学习内容归结为两类,概念和事实,概念比事实更重要 最佳学习概念的方式,是确保你知道并用自己的话讲述出来,就是用这种方式测试以及更有积极性的学习,还有就是通过距离来说明,再最为重要的地方标记 做笔记对模糊不清的地方进行一点补充,添加一些内容,方便更好的记住概念 最好的学习方式就是靠教别人来学习,因为这是一种积极学习的方式,还能确保自己完全理解课题 正确使用教科书,SQ3R方法: 纵览 提问 阅读 诵读 回顾","path":"2017/06/21/阅读习惯/","date":"06-21","excerpt":"怎么阅读"},{"title":"阅读习惯","text":"13个关于阅读的 间歇重复 spaced repetiton为了最大化学习效率 进行时间短但频率高的学习 神经突触大部分在晚上睡觉的时候生长 这意味着有规律的学习 期间有睡眠先休息 这样更有效率 找到自己的风格 find your own style良好的睡眠 good night’s sleep睡觉与做梦是处理和存储新信息至关重要的部分 集中注意力 focus如果你易于拖延 也就是说你倾向于进行学习数学之类的困难任务转到轻松的事情如浏览网页 番茄工作法 pomodoro technique定时间25分钟时间 在此间完完全全专心于学习 当闹钟响起 放松5分钟 如果想继续 再定时开始 先做困难项 hard stuff first在早上有着最强的意志力 一旦你完成了困难的事情 你接下来一整天都会感觉更好 可能得到更多动力激发你完成其他的事项 运动 冥想 以及交谈 exercise meditate and converse有些活动被证实能让你的大脑增长 它们引起你的大脑中新的神经元的产生 从而增长其潜力 到不同的地方去 go places能创建对实物更深刻的记忆 更多的视觉线索进行记忆 认真看待乐趣 take fu seriously间隔再学习 space your studies按记忆曲线回顾 30%read 70% reciteinstant self-test额外的努力能制造更深刻的记忆痕迹 不要强迫 don’t force it","path":"2017/06/21/13个学习技巧/","date":"06-21","excerpt":"13个关于阅读的"},{"title":"数据结构队列(C++)","text":"数据结构是指互相之间存在一种或多种特定关系的数据元素的集合 什么是数据结构?数据结构是指互相之间存在一种或多种特定关系的数据元素的集合 队列先进先出 FIFO:first in first out普通队列:有两种情况第一种:售票员不动,第一个人买到票走后,后面一个人向前走,变成队列头,但是效率低第二种:售票员一直向后走,但是前面的内存空间就被浪费了环形队列元素空间可以重复利用:因为一般的环形队列都是一个元素数固定的一个闭环，可以在环形队列初始化的时候分配好确定的内存空间，当进队或出队时只需要返回指定元素内存空间的地址即可，这些内存空间可以重复利用，避免频繁内存分配和释放的开销。 环形队列C++实现class MyQueue { public: MyQueue(int queueCapacity);//创建队列 virtual ~MyQueue();//销毁队列,析构函数 void ClearQueue();//清空队列 bool QueueEmpty() const;//判空队列 int QueueLength() const;//队列长度 bool Enqueue(int element);//新元素入队 bool DeQueue(int &element);//首元素出队 void QueueTraverse();//遍历队列 private: int *m_pQueue;//队列数组指针 int m_iQueueLen;//队列元素个数 int m_iQueueCapacity;//队列数组容量 }","path":"2017/06/11/数据结构队列篇/","date":"06-11","excerpt":"数据结构是指互相之间存在一种或多种特定关系的数据元素的集合"},{"title":"ssh","text":"","path":"2017/05/17/ssh/","date":"05-17","excerpt":""},{"title":"热拔插","text":"热插拔（hot-plugging或Hot Swap）即带电插拔，热插拔功能就是允许用户在不关闭系统，不切断电源的情况下取出和更换损坏的硬盘、电源或板卡等部件，从而提高了系统对灾难的及时恢复能力、扩展性和灵活性等。因为热插拔可以节省时间，减少操作步骤，还可以降低开关机时启动电流过大对计算机硬件的冲击（还有一个主要原因是符合人的惰性），所以被一些电脑玩家频繁使用。 关于硬盘的热拔插 以前的硬盘磁头不具备自动停靠的功能，在通电状态下磁头是“飞行”在盘片上面的，当系统断电之前，必须用一条叫“Park”的专用命令，来让磁头归位。否则，就有可能因为盘片瞬间停转而磁头来不及归位，造成盘片被磁头“铲伤”。 而现在的硬盘，只有当读取数据的时候，磁头才会飞行在盘片表面。一旦读取动作结束，磁头立即自动归位停靠。同时，现在的硬盘都具备延时断电的功能。即当系统供电突然丢失时，硬盘本身的控制器能自动探测到这个变化，然后强迫磁头停止当前读写指令的执行，并使磁头正常归位.这个设计大大加强了硬盘在意外断电情况下的安全系数。 所以，盘片损伤的可能性其实是极低的。但这并不意味着热插拔硬盘是毫无危险的。因为开机状态下带电插拔硬盘，都会产生一个瞬时的冲击电流，过去我们认为这是造成硬盘带电插拔损坏的罪魁祸首。然而事实上，硬盘电源接口电路对这种瞬间电流的变化的宽容度是比较大的，绝大多数时候并不会导致硬盘电路板被烧毁。真正的危险来自于硬盘的数据线！ 在带电状态下插拔硬盘数据线，数据线上也会产生不正常的瞬间电流和压降，导致多个精密控制芯片被烧毁，这才是真正的“硬盘杀手”。 因此，只要我们能保证插拔电源线和数据线的顺序正确，即“插”硬盘的时候先接数据线，后接电源线；“拔”硬盘的时候正相反，先拔电源线，后拔数据线。这样，硬盘热插拔就不是天方夜谭！","path":"2017/05/07/热拔插/","date":"05-07","excerpt":"热插拔（hot-plugging或Hot Swap）即带电插拔，热插拔功能就是允许用户在不关闭系统，不切断电源的情况下取出和更换损坏的硬盘、电源或板卡等部件，从而提高了系统对灾难的及时恢复能力、扩展性和灵活性等。因为热插拔可以节省时间，减少操作步骤，还可以降低开关机时启动电流过大对计算机硬件的冲击（还有一个主要原因是符合人的惰性），所以被一些电脑玩家频繁使用。"},{"title":"硬盘","text":"硬盘不是内存。硬盘是电脑主要的存储媒介之一，由一个或者多个铝制或者玻璃制的碟片组成。碟片外覆盖有铁磁性材料。硬盘有固态硬盘（SSD 盘，新式硬盘）、机械硬盘（HDD 传统硬盘）、混合硬盘（HHD 一块基于传统机械硬盘诞生出来的新硬盘）。SSD采用闪存颗粒来存储，HDD采用磁性碟片来存储，混合硬盘（HHD: Hybrid Hard Disk）是把磁性硬盘和闪存集成到一起的一种硬盘。绝大多数硬盘都是固定硬盘，被永久性地密封固定在硬盘驱动器中。内存是计算机中重要的部件之一，它是与CPU进行沟通的桥梁。计算机中所有程序的运行都是在内存中进行的，因此内存的性能对计算机的影响非常大。内存（Memory）也被称为内存储器，其作用是用于暂时存放CPU中的运算数据，以及与硬盘等外部存储器交换的数据。只要计算机在运行中，CPU就会把需要运算的数据调到内存中进行运算，当运算完成后CPU再将结果传送出来，内存的运行也决定了计算机的稳定运行。 内存是由内存芯片、电路板、金手指等部分组成的","path":"2017/05/05/硬盘/","date":"05-05","excerpt":"硬盘不是内存。硬盘是电脑主要的存储媒介之一，由一个或者多个铝制或者玻璃制的碟片组成。碟片外覆盖有铁磁性材料。"},{"title":"回调函数","text":"你到一个商店买东西，刚好你要的东西没有货，于是你在店员那里留下了你的电话，过了几天店里有货了，店员就打了你的电话，然后你接到电话后就到店里去取了货。在这个例子里，你的电话号码就叫回调函数，你把电话留给店员就叫登记回调函数，店里后来有货了叫做触发了回调关联的事件，店员给你打电话叫做调用回调函数，你到店里去取货叫做响应回调事件。回答完毕。","path":"2017/05/03/回调函数/","date":"05-03","excerpt":""},{"title":"虚拟内存（页面文件）","text":"1.页面文件（pagefile.sys）也称虚拟内存，就是在硬盘上拿出（设定出）一部分空间作为暂不被调用程序或叫“惰性”程序及相关数据的临时存放空间。 因内存容量总是有限,而实际运行的程序会很多，若都塞在内存中会大量占用有限的内存资源，不利于系统正常、快速、流畅地调用、运行急需的程序及数据。于是系统就开辟出一部分硬盘空间将惰性程序及相关数据暂时存放于此，而让即将被调用的程序或称“活性”程序及数据存留在内存中方便马上调用；而页面文件中暂存的“惰性程序”及数据待CPU需要调用时再与内存交互，如此即为页面文件的工作原理。页面文件像内存一样起到中间暂存、交换作用又是硬盘空间的一部分，所以又叫虚拟内存。 2。 页面文件如同文件夹中常见文件一样，是实实在在存在的文件，只是为安全起见系统将其默认为隐藏文件，显示后一般可在系统盘根目录中见到名为pagefile.sys的文件，它就是页面文件。 3。 要修改页面文件（虚拟内存）的存放位置及大小，对XP而言：可在“我的电脑”上右击选“属性”—“高级”选项卡里的“性能”选项框中—“设置”—“高级”—“虚拟内存”框中—“更改”即来到虚拟内存设置窗口（WIN2000进入类似）。要先确定你的页面文件在哪个驱动器盘符，然后将别的盘符驱动器的页面文件全部禁用，可保留一个页面文件。微软的默认设置是，页面文件最小值应为物理内存的1.5倍，最大值为2-3倍。我的设置建议是同意微软的默认设置，不需要另设它值。若物理内存为1G又觉得1.5倍的最小值设置占硬盘空间较大，最小值可设为1G即物理内存的1倍，以后若出现问题则改回默认设置；最大值默认即可。因页面文件的使用是由小至大、逐渐增加的过程，若最小值范围内可正常运行、交互，系统就不会再增大到最大值的程度。 4。 页面文件最好单独设置在一个盘符里（我的机器就设置到了F盘中），如此能使系统调用虚拟内存中的程序及数据时能更快速、更流畅。还有，变更页面文件的位置之前最好能对相应盘符进行磁盘碎片整理，以使页面文件连续、规律地存放利于快速读取。","path":"2017/05/03/虚拟内存/","date":"05-03","excerpt":"1.页面文件（pagefile.sys）也称虚拟内存，就是在硬盘上拿出（设定出）一部分空间作为暂不被调用程序或叫“惰性”程序及相关数据的临时存放空间。"}]}